toasterllc/MDCCode/Code/STM32/STLoader/Source/main.cpp
#include <string.h>
#include <algorithm>

#define TaskARM32
#include "Toastbox/Task.h"

#include "Assert.h"
#include "SystemClock.h"
#include "Toastbox/IntState.h"
#include "STM.h"
#include "USB.h"
#include "QSPI.h"
#include "BufQueue.h"
#include "SystemBase.h"

using namespace STM;





// Peripherals
USB _USB;

// QSPI clock divider=5 => run QSPI clock at 21.3 MHz
// QSPI alignment=byte, so we can transfer single bytes at a time
QSPI _QSPI(QSPI::Mode::Single, 5, QSPI::Align::Byte, QSPI::ChipSelect::Controlled);

using _ICE_CRST_ = GPIO<GPIOPortI, GPIO_PIN_6>;
using _ICE_CDONE = GPIO<GPIOPortI, GPIO_PIN_7>;
using _ICE_ST_SPI_CLK = GPIO<GPIOPortB, GPIO_PIN_2>;
using _ICE_ST_SPI_CS_ = GPIO<GPIOPortB, GPIO_PIN_6>;

STM::Cmd _Cmd = {};

alignas(4) uint8_t _Buf0[1024]; // Aligned to send via USB
alignas(4) uint8_t _Buf1[1024]; // Aligned to send via USB
BufQueue<2> _Bufs(_Buf0, _Buf1);

struct {
    size_t len = 0;
    alignas(4) bool status = false; // Aligned to send via USB
} _USBDataIn;

struct {
    struct {
        uint8_t bits = 0;
        uint8_t bitsLen = 0;
        size_t len = 0;
    } read;
} _MSPDebug;

static constexpr uint32_t _UsPerTick  = 1000;

class _CmdRecvTask;
class _CmdHandleTask;
class _USBDataOutTask;

#define _Subtasks       \
    _CmdHandleTask,     \
    _USBDataOutTask

using _Scheduler = Toastbox::Scheduler<
    // Microseconds per tick
    _UsPerTick,
    // Tasks
    _CmdRecvTask,
    _Subtasks
>;

//Toastbox::Task _usb_cmdTask             = Toastbox::Task([&] {  _usb_cmdTaskFn();           });
//Toastbox::Task _usb_dataOutTask         = Toastbox::Task([&] {  _usb_dataOutTaskFn();       });
//Toastbox::Task _usb_dataInTask          = Toastbox::Task([&] {  _usb_dataInTaskFn();        });
//Toastbox::Task _endpointsFlush_task     = Toastbox::Task([&] {  _endpointsFlush_taskFn();   });
//Toastbox::Task _statusGet_task          = Toastbox::Task([&] {  _statusGet_taskFn();        });
//Toastbox::Task _bootloaderInvoke_task   = Toastbox::Task([&] {  _bootloaderInvoke_taskFn(); });
//Toastbox::Task _stm_writeTask           = Toastbox::Task([&] {  _stm_writeTaskFn();         });
//Toastbox::Task _stm_resetTask           = Toastbox::Task([&] {  _stm_resetTaskFn();         });
//Toastbox::Task _ice_writeTask           = Toastbox::Task([&] {  _ice_writeTaskFn();         });
//Toastbox::Task _msp_readTask            = Toastbox::Task([&] {  _msp_readTaskFn();          });
//Toastbox::Task _msp_writeTask           = Toastbox::Task([&] {  _msp_writeTaskFn();         });
//Toastbox::Task _msp_debugTask           = Toastbox::Task([&] {  _msp_debugTaskFn();         });
//
//std::reference_wrapper<Toastbox::Task> _tasks[12] = {
//    _usb_cmdTask,
//    _usb_dataOutTask,
//    _usb_dataInTask,
//    _endpointsFlush_task,
//    _statusGet_task,
//    _bootloaderInvoke_task,
//    _stm_writeTask,
//    _stm_resetTask,
//    _ice_writeTask,
//    _msp_readTask,
//    _msp_writeTask,
//    _msp_debugTask,
//};



























template <typename... T_Tasks>
static void _ResetTasks() {
    (_Scheduler::Stop<T_Tasks>(), ...);
}

static size_t _ceilToMaxPacketSize(size_t len) {
    // Round `len` up to the nearest packet size, since the USB hardware limits
    // the data received based on packets instead of bytes
    const size_t rem = len%USB::MaxPacketSizeIn();
    len += (rem>0 ? USB::MaxPacketSizeIn()-rem : 0);
    return len;
}

// _usb_dataOutTask: reads `_usbDataOut.len` bytes from the DataOut endpoint and writes it to _Bufs
struct _USBDataOutTask {
    static void Recv(size_t len) {
        // Make sure this task isn't busy
        Assert(!_Scheduler::Running<_USBDataOutTask>());
        
        _Len = len;
        _Scheduler::Start<_USBDataOutTask>([] {
            while (_Len) {
                _Scheduler::Wait([] { return !_Bufs.full(); });
                
                // Prepare to receive either `_Len` bytes or the
                // buffer capacity bytes, whichever is smaller.
                const size_t cap = _ceilToMaxPacketSize(std::min(_Len, _Bufs.back().cap));
                // Ensure that after rounding up to the nearest packet size, we don't
                // exceed the buffer capacity. (This should always be safe as long as
                // the buffer capacity is a multiple of the max packet size.)
                Assert(cap <= _Bufs.back().cap);
                _USB.recv(Endpoints::DataOut, _Bufs.back().data, cap);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
                
                // Never claim that we read more than the requested data, even if ceiling
                // to the max packet size caused us to read more than requested.
                const size_t recvLen = std::min(_Len, _USB.recvLen(Endpoints::DataOut));
                _Len -= recvLen;
                _Bufs.back().len = recvLen;
                _Bufs.push();
            }
        });
    }
    
    // Task options
    using Options = Toastbox::TaskOptions<>;
    
    // Task stack
    [[gnu::section(".stack._USBDataOutTask")]]
    static inline uint8_t Stack[256];
    
private:
    static inline size_t _Len = 0;
};

static void _usb_dataInSendStatus(bool s) {
    alignas(4) static bool status = false; // Aligned to send via USB
    status = s;
    _USB.send(Endpoints::DataIn, &status, sizeof(status));
}




//// _usb_dataInTask: writes buffers from _Bufs to the DataIn endpoint, and pops them from _Bufs
//void _usb_dataInTaskFn() {
//    TaskBegin();
//    
//    for (;;) {
//        TaskWait(!_Bufs.empty());
//        
//        // Send the data and wait until the transfer is complete
//        _USB.send(Endpoints::DataIn, _Bufs.front().data, _Bufs.front().len);
//        TaskWait(_USB.endpointReady(Endpoints::DataIn));
//        
//        _Bufs.front().len = 0;
//        _Bufs.pop();
//    }
//}
//
//void _usb_dataInSendStatus(bool status) {
//    _usbDataIn.status = status;
//    _USB.send(Endpoints::DataIn, &_usbDataIn.status, sizeof(_usbDataIn.status));
//}
//
//void _endpointsFlush_taskFn() {
//    TaskBegin();
//    // Reset endpoints
//    _USB.endpointReset(Endpoints::DataOut);
//    _USB.endpointReset(Endpoints::DataIn);
//    TaskWait(_USB.endpointReady(Endpoints::DataOut) && _USB.endpointReady(Endpoints::DataIn));
//    // Send status
//    _usb_dataInSendStatus(true);
//}
//
//void _statusGet_taskFn() {
//    TaskBegin();
//    // Send status
//    _usb_dataInSendStatus(true);
//    // Wait for host to receive status
//    TaskWait(_USB.endpointReady(Endpoints::DataIn));
//    
//    // Send status struct
//    alignas(4) static const STM::Status status = { // Aligned to send via USB
//        .magic      = STM::Status::MagicNumber,
//        .version    = STM::Version,
//        .mode       = STM::Status::Modes::STMLoader,
//    };
//    
//    _USB.send(Endpoints::DataIn, &status, sizeof(status));
//}
//
//void _bootloaderInvoke_taskFn() {
//    TaskBegin();
//    // Send status
//    _usb_dataInSendStatus(true);
//    // Wait for host to receive status before resetting
//    TaskWait(_USB.endpointReady(Endpoints::DataIn));
//    
//    // Perform software reset
//    HAL_NVIC_SystemReset();
//    // Unreachable
//    abort();
//}

