toasterllc/MDCCode/Code/STM32/STLoader/Source/main.cpp
//static size_t _stm_regionCapacity(void* addr) {
//    // Verify that `addr` is in one of the allowed RAM regions
//    extern uint8_t _sitcm_ram[], _eitcm_ram[];
//    extern uint8_t _sdtcm_ram[], _edtcm_ram[];
//    extern uint8_t _ssram1[], _esram1[];
//    size_t cap = 0;
//    if (addr>=_sitcm_ram && addr<_eitcm_ram) {
//        cap = (uintptr_t)_eitcm_ram-(uintptr_t)addr;
//    } else if (addr>=_sdtcm_ram && addr<_edtcm_ram) {
//        cap = (uintptr_t)_edtcm_ram-(uintptr_t)addr;
//    } else if (addr>=_ssram1 && addr<_esram1) {
//        cap = (uintptr_t)_esram1-(uintptr_t)addr;
//    } else {
//        // TODO: implement proper error handling on writing out of the allowed regions
//        abort();
//    }
//    return cap;
//}
//
//void _stm_writeTaskFn() {
//    const auto& arg = _Cmd.arg.STMWrite;
//    
//    TaskBegin();
//    
//    // Bail if the region capacity is too small to hold the
//    // incoming data length (ceiled to the packet length)
//    static size_t len;
//    len = _ceilToMaxPacketSize(arg.len);
//    if (len > _stm_regionCapacity((void*)arg.addr)) {
//        // Send preliminary status: error
//        _usb_dataInSendStatus(false);
//        return;
//    }
//    
//    // Send preliminary status: OK
//    _usb_dataInSendStatus(true);
//    TaskWait(_USB.endpointReady(Endpoints::DataIn));
//    
//    // Receive USB data
//    _USB.recv(Endpoints::DataOut, (void*)arg.addr, len);
//    TaskWait(_USB.endpointReady(Endpoints::DataOut));
//    
//    // Send final status
//    _usb_dataInSendStatus(true);
//}
//
//void _stm_resetTaskFn() {
//    TaskBegin();
//    Start.setAppEntryPointAddr(_Cmd.arg.STMReset.entryPointAddr);
//    
//    // Send status
//    _usb_dataInSendStatus(true);
//    // Wait for host to receive status before resetting
//    TaskWait(_USB.endpointReady(Endpoints::DataIn));
//    
//    // Perform software reset
//    HAL_NVIC_SystemReset();
//    // Unreachable
//    abort();
//}
//
//static void _ice_qspiWrite(QSPI& qspi, const void* data, size_t len) {
//    QSPI_CommandTypeDef cmd = {
//        .Instruction = 0,
//        .InstructionMode = QSPI_INSTRUCTION_NONE,
//        
//        .Address = 0,
//        .AddressSize = QSPI_ADDRESS_8_BITS,
//        .AddressMode = QSPI_ADDRESS_NONE,
//        
//        .AlternateBytes = 0,
//        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_8_BITS,
//        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
//        
//        .DummyCycles = 0,
//        
//        .NbData = (uint32_t)len,
//        .DataMode = QSPI_DATA_1_LINE,
//        
//        .DdrMode = QSPI_DDR_MODE_DISABLE,
//        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
//        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
//    };
//    
//    qspi.write(cmd, data, len);
//}
//
//void _ice_writeTaskFn() {
//    auto& arg = _Cmd.arg.ICEWrite;
//    TaskBegin();
//    
//    // Configure ICE40 control GPIOs
//    _ICE_CRST_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
//    _ICE_CDONE::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
//    _ICE_ST_SPI_CLK::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
//    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
//    
//    // Put ICE40 into configuration mode
//    _ICE_ST_SPI_CLK::Write(1);
//    
//    _ICE_ST_SPI_CS_::Write(0);
//    _ICE_CRST_::Write(0);
//    HAL_Delay(1); // Sleep 1 ms (ideally, 200 ns)
//    
//    _ICE_CRST_::Write(1);
//    HAL_Delay(2); // Sleep 2 ms (ideally, 1.2 ms for 8K devices)
//    
//    // Release chip-select before we give control of _ICE_ST_SPI_CLK/_ICE_ST_SPI_CS_ to QSPI
//    _ICE_ST_SPI_CS_::Write(1);
//    
//    // Have QSPI take over _ICE_ST_SPI_CLK/_ICE_ST_SPI_CS_
//    _qspi.config();
//    
//    // Send 8 clocks and wait for them to complete
//    static const uint8_t ff = 0xff;
//    _ice_qspiWrite(_qspi, &ff, 1);
//    TaskWait(_qspi.ready());
//    
//    // Reset state
//    _Bufs.reset();
//    // Trigger the USB DataOut task with the amount of data
//    _usb_dataOutTask.start();
//    _usbDataOut.len = arg.len;
//    
//    while (arg.len) {
//        // Wait until we have data to consume, and QSPI is ready to write
//        TaskWait(!_Bufs.empty() && _qspi.ready());
//        
//        // Write the data over QSPI and wait for completion
//        _ice_qspiWrite(_qspi, _Bufs.front().data, _Bufs.front().len);
//        TaskWait(_qspi.ready());
//        
//        // Update the remaining data and pop the buffer so it can be used again
//        arg.len -= _Bufs.front().len;
//        _Bufs.pop();
//    }
//    
//    // Wait for CDONE to be asserted
//    {
//        bool ok = false;
//        for (int i=0; i<10 && !ok; i++) {
//            if (i) HAL_Delay(1); // Sleep 1 ms
//            ok = _ICE_CDONE::Read();
//        }
//        
//        if (!ok) {
//            _usb_dataInSendStatus(false);
//            return;
//        }
//    }
//    
//    // Finish
//    {
//        // Supply >=49 additional clocks (8*7=56 clocks), per the
//        // "iCE40 Programming and Configuration" guide.
//        // These clocks apparently reach the user application. Since this
//        // appears unavoidable, prevent the clocks from affecting the user
//        // application in two ways:
//        //   1. write 0xFF, which the user application must consider as a NOP;
//        //   2. write a byte at a time, causing chip-select to be de-asserted
//        //      between bytes, which must cause the user application to reset
//        //      itself.
//        constexpr uint8_t ClockCount = 7;
//        static int i;
//        for (i=0; i<ClockCount; i++) {
//            static const uint8_t ff = 0xff;
//            _ice_qspiWrite(_qspi, &ff, sizeof(ff));
//            TaskWait(_qspi.ready());
//        }
//    }
//    
//    _usb_dataInSendStatus(true);
//}
//
//void _msp_connect() {
//    const auto r = _MSP.connect();
//    // Send status
//    _usb_dataInSendStatus(r == _MSP.Status::OK);
//}
//
//void _msp_disconnect() {
//    _MSP.disconnect();
//    // Send status
//    _usb_dataInSendStatus(true);
//}
//
//void _msp_readTaskFn() {
//    auto& arg = _Cmd.arg.MSPRead;
//    TaskBegin();
//    
//    // Reset state
//    _Bufs.reset();
//    
//    // Start the USB DataIn task
//    _usb_dataInTask.start();
//    
//    while (arg.len) {
//        TaskWait(!_Bufs.full());
//        
//        auto& buf = _Bufs.back();
//        // Prepare to receive either `arg.len` bytes or the
//        // buffer capacity bytes, whichever is smaller.
//        const size_t chunkLen = std::min((size_t)arg.len, buf.cap);
//        _MSP.read(arg.addr, buf.data, chunkLen);
//        arg.addr += chunkLen;
//        arg.len -= chunkLen;
//        // Enqueue the buffer
//        buf.len = chunkLen;
//        _Bufs.push();
//    }
//    
//    // Wait for DataIn task to complete
//    TaskWait(_Bufs.empty());
//    // Send status
//    _usb_dataInSendStatus(true);
//}
//
//void _msp_writeTaskFn() {
//    auto& arg = _Cmd.arg.MSPWrite;
//    TaskBegin();
//    
//    // Reset state
//    _Bufs.reset();
//    _MSP.crcReset();
//    
//    // Trigger the USB DataOut task with the amount of data
//    _usb_dataOutTask.start();
//    _usbDataOut.len = arg.len;
//    
//    while (arg.len) {
//        TaskWait(!_Bufs.empty());
//        
//        // Write the data over Spy-bi-wire
//        auto& buf = _Bufs.front();
//        _MSP.write(arg.addr, buf.data, buf.len);
//        // Update the MSP430 address to write to
//        arg.addr += buf.len;
//        arg.len -= buf.len;
//        // Pop the buffer, which we just finished sending over Spy-bi-wire
//        _Bufs.pop();
//    }
//    
//    // Verify the CRC of all the data we wrote
//    const auto r = _MSP.crcVerify();
//    // Send status
//    _usb_dataInSendStatus(r == _MSP.Status::OK);
//}
//
//void _msp_debugTaskFn() {
//    auto& arg = _Cmd.arg.MSPDebug;
//    TaskBegin();
//    
//    // Bail if more data was requested than the size of our buffer
//    if (arg.respLen > sizeof(_buf1)) {
//        // Send preliminary status: error
//        _usb_dataInSendStatus(false);
//        return;
//    }
//    
//    // Send preliminary status: OK
//    _usb_dataInSendStatus(true);
//    TaskWait(_USB.endpointReady(Endpoints::DataIn));
//    
//    static bool ok;
//    ok = true;
//    
//    // Handle debug commands
//    {
//        while (arg.cmdsLen) {
//            // Receive debug commands into _buf0
//            _USB.recv(Endpoints::DataOut, _buf0, sizeof(_buf0));
//            TaskWait(_USB.endpointReady(Endpoints::DataOut));
//            
//            // Handle each MSPDebugCmd
//            const MSPDebugCmd* cmds = (MSPDebugCmd*)_buf0;
//            const size_t cmdsLen = _USB.recvLen(Endpoints::DataOut) / sizeof(MSPDebugCmd);
//            for (size_t i=0; i<cmdsLen && ok; i++) {
//                ok &= _msp_debugHandleCmd(cmds[i]);
//            }
//            
//            arg.cmdsLen -= cmdsLen;
//        }
//    }
//    
//    // Reply with data generated from debug commands
//    {
//        // Push outstanding bits into the buffer
//        // This is necessary for when the client reads a number of bits
//        // that didn't fall on a byte boundary.
//        if (_mspDebug.read.bitsLen) ok &= _msp_debugPushReadBits();
//        _mspDebug.read = {};
//        
//        if (arg.respLen) {
//            // Send the data and wait for it to be received
//            _USB.send(Endpoints::DataIn, _buf1, arg.respLen);
//            TaskWait(_USB.endpointReady(Endpoints::DataIn));
//        }
//    }
//    
//    // Send status
//    _usb_dataInSendStatus(ok);
//}
//
//bool _msp_debugPushReadBits() {
//    if (_mspDebug.read.len >= sizeof(_buf1)) return false;
//    // Enqueue the new byte into `_buf1`
//    _buf1[_mspDebug.read.len] = _mspDebug.read.bits;
//    _mspDebug.read.len++;
//    // Reset our bits
//    _mspDebug.read.bits = 0;
//    _mspDebug.read.bitsLen = 0;
//    return true;
//}
//
//bool _msp_debugHandleSBWIO(const MSPDebugCmd& cmd) {
//    const bool tdo = _MSP.debugSBWIO(cmd.tmsGet(), cmd.tclkGet(), cmd.tdiGet());
//    if (cmd.tdoReadGet()) {
//        // Enqueue a new bit
//        _mspDebug.read.bits <<= 1;
//        _mspDebug.read.bits |= tdo;
//        _mspDebug.read.bitsLen++;
//        
//        // Enqueue the byte if it's filled
//        if (_mspDebug.read.bitsLen == 8) {
//            return _msp_debugPushReadBits();
//        }
//    }
//    return true;
//}
//
//bool _msp_debugHandleCmd(const MSPDebugCmd& cmd) {
//    switch (cmd.opGet()) {
//    case MSPDebugCmd::Ops::TestSet:     _MSP.debugTestSet(cmd.pinValGet()); return true;
//    case MSPDebugCmd::Ops::RstSet:      _MSP.debugRstSet(cmd.pinValGet());  return true;
//    case MSPDebugCmd::Ops::TestPulse:   _MSP.debugTestPulse();              return true;
//    case MSPDebugCmd::Ops::SBWIO:       return _msp_debugHandleSBWIO(cmd);
//    default:                            abort();
//    }
//}

void _statusGet() {
    // Send status
    _usb_dataInSendStatus(true);
    // Wait for host to receive status
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
