toasterllc/MDCCode/Code/STM32/STLoader/Source/main.cpp
    // Send status struct
    alignas(4) static const STM::Status status = { // Aligned to send via USB
        .magic      = STM::Status::MagicNumber,
        .version    = STM::Version,
        .mode       = STM::Status::Modes::STMLoader,
    };
    
    _USB.send(Endpoints::DataIn, &status, sizeof(status));
}


static void _ledSet() {
    switch (_Cmd.arg.LEDSet.idx) {
    case 0: _usb_dataInSendStatus(false); return;
    case 1: SystemBase::LED1::Write(_Cmd.arg.LEDSet.on); break;
    case 2: SystemBase::LED2::Write(_Cmd.arg.LEDSet.on); break;
    case 3: SystemBase::LED3::Write(_Cmd.arg.LEDSet.on); break;
    }
    
    // Send status
    _usb_dataInSendStatus(true);
}

static void _endpointsFlush() {
    // Reset endpoints
    _USB.endpointReset(Endpoints::DataOut);
    _USB.endpointReset(Endpoints::DataIn);
    // Wait until both endpoints are ready
    _Scheduler::Wait([] {
        return _USB.endpointReady(Endpoints::DataOut) &&
               _USB.endpointReady(Endpoints::DataIn);
    });
    // Send status
    _usb_dataInSendStatus(true);
}

struct _CmdHandleTask {
    static void CmdHandle() {
        _Scheduler::Start<_CmdHandleTask>([] { _CmdHandle(); });
    }
    
    static void _CmdHandle() {
        switch (_Cmd.op) {
        // Common Commands
        case Op::EndpointsFlush:    _endpointsFlush();  break;
        case Op::StatusGet:         _statusGet();       break;
//            case Op::BootloaderInvoke:  _bootloaderInvoke_task.start(); break;
        case Op::LEDSet:            _ledSet();          break;
//            // STM32 Bootloader
//            case Op::STMWrite:          _stm_writeTask.start();         break;
//            case Op::STMReset:          _stm_resetTask.start();         break;
//            // ICE40 Bootloader
//            case Op::ICEWrite:          _ice_writeTask.start();         break;
//            // MSP430 Bootloader
//            case Op::MSPConnect:        _msp_connect();                 break;
//            case Op::MSPDisconnect:     _msp_disconnect();              break;
//            // MSP430 Debug
//            case Op::MSPRead:           _msp_readTask.start();          break;
//            case Op::MSPWrite:          _msp_writeTask.start();         break;
//            case Op::MSPDebug:          _msp_debugTask.start();         break;
        // Bad command
        default:                    _usb_dataInSendStatus(false);   break;
        }
    }
    
    // Task options
    using Options = Toastbox::TaskOptions<>;
    
    // Task stack
    [[gnu::section(".stack._CmdHandleTask")]]
    static inline uint8_t Stack[256];
};

struct _CmdRecvTask {
    static void Run() {
        for (;;) {
            // Wait for USB to be re-connected (`Connecting` state) so we can call _USB.connect(),
            // or for a new command to arrive so we can handle it.
            _Scheduler::Wait([&] { return _USB.state()==USB::State::Connecting || _USB.cmdRecv(); });
            
            #warning TODO: do we still need to disable interrupts?
            // Disable interrupts so we can inspect+modify _usb atomically
            Toastbox::IntState ints(false);
            
            // Reset all tasks
            // This needs to happen before we call `_USB.connect()` so that any tasks that
            // were running in the previous USB session are stopped before we enable
            // USB again by calling _USB.connect().
            _ResetTasks<_Subtasks>();
            
            switch (_USB.state()) {
            case USB::State::Connecting:
                _USB.connect();
                continue;
            case USB::State::Connected:
                if (!_USB.cmdRecv()) continue;
                break;
            default:
                continue;
            }
            
            auto usbCmd = *_USB.cmdRecv();
            
            // Re-enable interrupts while we handle the command
            ints.restore();
            
            // Reject command if the length isn't valid
            if (usbCmd.len != sizeof(_Cmd)) {
                _USB.cmdAccept(false);
                continue;
            }
            
            memcpy(&_Cmd, usbCmd.data, usbCmd.len);
            
            // Only accept command if it's a flush command (in which case the endpoints
            // don't need to be ready), or it's not a flush command, but both endpoints
            // are ready. Otherwise, reject the command.
            if (!(_Cmd.op==Op::EndpointsFlush || (_USB.endpointReady(Endpoints::DataOut) && _USB.endpointReady(Endpoints::DataIn)))) {
                _USB.cmdAccept(false);
                continue;
            }
            
            _USB.cmdAccept(true);
            _CmdHandleTask::CmdHandle();
        }
    }
    
    // Task options
    using Options = Toastbox::TaskOptions<
        Toastbox::TaskOption::AutoStart<Run> // Task should start running
    >;
    
    // Task stack
    [[gnu::section(".stack._CmdRecvTask")]]
    static inline uint8_t Stack[256];
};










#define CheckStack() Assert((void*)__get_MSP()>=_StackMain && (void*)__get_MSP()<=(_StackMain+sizeof(_StackMain)))

// MARK: - ISRs

extern "C" [[gnu::section(".isr")]] void ISR_NMI()          {}
extern "C" [[gnu::section(".isr")]] void ISR_HardFault()    { abort(); }
extern "C" [[gnu::section(".isr")]] void ISR_MemManage()    { abort(); }
extern "C" [[gnu::section(".isr")]] void ISR_BusFault()     { abort(); }
extern "C" [[gnu::section(".isr")]] void ISR_UsageFault()   { abort(); }

//static volatile uint32_t _psp = 0;
//
//extern "C" [[gnu::section(".isr"), gnu::naked]] void ISR_SVC() {
////    _psp = __get_PSP();
//    // Exit to Thread mode, with SP using PSP (process SP)
//    asm("mov lr, %0" : : "i" (0xFFFFFFE1) : );
//    asm("bx lr");
//    
////    _psp = __get_PSP();
////    // Exit to Thread mode, with SP using PSP (process SP)
////    asm("mov lr, %0" : : "i" (EXC_RETURN_THREAD_PSP_FPU) : );
////    asm("bx lr");
//}

extern "C" [[gnu::section(".isr")]] void ISR_SVC()          {}
extern "C" [[gnu::section(".isr")]] void ISR_DebugMon()     {}
extern "C" [[gnu::section(".isr")]] void ISR_PendSV()       {}

extern "C" [[gnu::section(".isr")]] void ISR_SysTick() {
    CheckStack();
    HAL_IncTick();
}

extern "C" [[gnu::section(".isr")]] void ISR_OTG_HS() {
    CheckStack();
    _USB.isr();
}

extern "C" [[gnu::section(".isr")]] void ISR_QUADSPI() {
    CheckStack();
    _QSPI.isrQSPI();
}

extern "C" [[gnu::section(".isr")]] void ISR_DMA2_Stream7() {
    CheckStack();
    _QSPI.isrDMA();
}


// MARK: - IntState

bool Toastbox::IntState::InterruptsEnabled() {
    return !__get_PRIMASK();
}

